jcwang4/ME461_Lab_Repo/ME461_FinalProject/workspace/quadStarter_f28027/quad_main.c
// This function is called each time a char is recieved over UARTA.
void serialRXA(serial_t *s, char data) {
    numRXA ++;

}

void SPI_RXint(void) {
//    GpioDataRegs.GPASET.bit.GPIO5 = 1;
    uint16_t i;

    switch (SPIenc_state) {
    case 4:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        AccelXraw = readdata[1];
        AccelYraw = readdata[2];
        AccelZraw = readdata[3];
        accelx = AccelXraw*4.0/32767.0;
        accely = AccelYraw*4.0/32767.0;
        accelz = AccelZraw*4.0/32767.0;


        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x4200));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SPIenc_state = 5;
        break;
    case 5:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        gyroXraw = readdata[1];
        gyroYraw = readdata[2];
        gyroZraw = readdata[3];
        gyrox  = gyroXraw*250.0/32767.0;
        gyroy  = gyroYraw*250.0/32767.0;
        gyroz  = gyroZraw*250.0/32767.0;

        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x4A00));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;

        SPIenc_state = 6;

        break;
    case 6:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        mx = (float)readdata[1];
        my = (float)readdata[2];
        mz = (float)readdata[3];

        mx = mx - mx_offset;   //Add in the offset from calibration
        my = my - my_offset;   //Add in the offset from calibration
        mz = mz - mz_offset; //Add in the offset from calibration

        //Use arctan to get compass angle if quadrotor flat
        if(my < 0) {
            compass_angle = 270.0-(((float)atan((mx/my)))*180.0/PI);
        }
        else if(my > 0) {
            compass_angle = 90.0-(((float)atan((mx/my)))*180.0/PI);
        }
        else if((my == 0) && (mx < 0)) {
            compass_angle = 180.0;
        }
        if((my == 0) && (mx > 0)) {
            compass_angle = 0.0;
        }
        SPIenc_state = 99;  // no state

        if(calibration_state == 0){
            calibration_count++;

            if (calibration_count == 400) {
                calibration_state = 1;
                calibration_count = 0;
            }
        } else if(calibration_state == 1){

            accelx_offset+=accelx;
            accely_offset+=accely;
            accelz_offset+=accelz;

            gyrox_offset+=gyrox;
            gyroy_offset+=gyroy;
            gyroz_offset+=gyroz;


            calibration_count++;
            if (calibration_count == 400) {
                calibration_state = 2;
                accelx_offset/=400.0;
                accely_offset/=400.0;
                accelz_offset/=400.0;
                gyrox_offset/=400.0;
                gyroy_offset/=400.0;
                gyroz_offset/=400.0;
                calibration_count = 0;
            }

        } else if(calibration_state == 2){
            accelx = accelx - (accelx_offset);
            accely = accely - (accely_offset);
            accelz = accelz - (accelz_offset)+1;
            print_accelx = accelx;
            print_accely = accely;
            print_accelz = accelz;
            gyrox  = gyrox - gyrox_offset;
            gyroy  = gyroy - gyroy_offset;
            gyroz  = gyroz - gyroz_offset;
            print_gyrox = gyrox;
            print_gyroy = gyroy;
            print_gyroz = gyroz;
//            mpu_roll = atan2(accely, accelz);
//            mpu_pitch = atan2(-accelx, sqrt(accely*accely + accelz*accelz) );

            // This is the Working Madgwick Algorithm -Ramya
            MadgwickAHRSupdateIMU(Quaternions, DotQuaternions, mdg_beta,
                                  (PI/180.0)*gyrox,
                                  (PI/180.0)*gyroy,
                                  (PI/180.0)*gyroz,
                                  accelx, accely, accelz);

            q0 = Quaternions[0];
            q1 = Quaternions[1];
            q2 = Quaternions[2];
            q3 = Quaternions[3];

            R11 = 2.0*q0*q0 -1 + 2.0*q1*q1;
            R21 = 2.0*(q1*q2 - q0*q3);
            R31 = 2.0*(q1*q3 + q0*q2);
            R32 = 2.0*(q2*q3 - q0*q1);
            R33 = 2.0*q0*q0 -1 + 2.0*q3*q3;


//            Added - signs to angles
            roll_tilt =-1* atan2( R32, R33 );
            pitch_tilt = -1 * -atan( R31 / sqrt(1-R31*R31) );
            yaw_tilt =-1 *  atan2( R21, R11 );

            //Measurements from gyroscope
            pitch_tiltrate = (gyroy*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s
            roll_tiltrate = (gyrox*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s
            yaw_tiltrate = (gyroz*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s


//            FT = 50;
//            f1_x = FT * sin(pitch_tilt);
////            f1_y = -FT *
//
////                    Motor commands A1, B1, A2, B2
//
//
//
//            k_F = 0;
//            k_M = 0;
////            length rotor to CoM (m)
//            l = 0.0916

            EPwm1Regs.CMPA.half.CMPA = A1;
            EPwm1Regs.CMPB = B1;
            EPwm2Regs.CMPA.half.CMPA = A2;
            EPwm2Regs.CMPB = B2;

        }
        SPI_Interrupt_Finished = 1;
        GpioDataRegs.GPACLEAR.bit.GPIO5 = 1;
        break;

